# coding:utf-8
import requests
from bs4 import BeautifulSoup
import re
import os


headers = {
    'User-Agent': 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_6) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.1.2 Safari/605.1.15'
}


def getChengyu(cate, page):
    f=open("chengyu_urls.csv","a",encoding="utf-8")
    res=requests.get("https://www.chengyucidian.net/letter/"+str(cate)+"/p/"+str(page), headers=headers, allow_redirects=False)
    res.encoding="utf-8"
    soup=BeautifulSoup(res.text)
    urls=soup.select('div[class="cate"]')
    print(urls)
    urls=re.findall('\d+',str(urls))
    for url in urls:
        f.write("https://www.chengyucidian.net/cy/"+str(url)+".html"+"\n")

def getPageNum(cate):
    res = requests.get("https://www.chengyucidian.net/letter/"+str(cate), headers=headers, allow_redirects=False)
    res.encoding="utf-8"
    soup=BeautifulSoup(res.text)
    pagenum=soup.select('div[class="page"]')
    pagelist=re.findall('\d+',str(pagenum))
    if len(pagelist)>0:
        return pagelist[-1]
    else:
        return 0

def getIntroduction(url):
    res = requests.get(url, headers=headers, allow_redirects=False)
    res.encoding = "utf-8"
    soup = BeautifulSoup(res.text)
    chengyu=soup.select('h1')
    chengyu=str(chengyu[0]).replace("<h1>","")
    chengyu=chengyu.replace("</h1>","")
    print(chengyu)

    pinying = soup.select('div[class="con"] p')[0].get_text()
    jieshi = soup.select('div[class="con"] p')[1].get_text()
    chuchu = soup.select('div[class="con"] p')[2].get_text()
    shili = soup.select('div[class="con"] p')[3].get_text()
    jinyi = soup.select('p[class="ciLs"]')[0].get_text()
    fanyi = soup.select('p[class="ciLs"]')[1].get_text()


    #print(introText)
    return chengyu, pinying, jieshi,chuchu,shili,jinyi,fanyi

def getStruct(chengyu):
    if len(chengyu) != 4:
        return ""
    rs = ['A','A','A','A']
    rs[1] = "A" if chengyu[1] == chengyu[0] else "B"
    for x in range(0,2):
        if chengyu[2] == chengyu[x]:
            rs[2] = rs[x]
            break
        if x == 1:
            rs[2] = chr(ord(rs[1])+1)
    for x in range(0,3):
        if chengyu[3] == chengyu[x]:
            rs[3] = rs[x]
            break
        if x == 2:
            rs[3] = chr(ord(max(rs))+1)
    return "".join(rs)





if __name__=="__main__":
    #Step1： 根据26个字母获取所有的成语链接和分页数
    #for i in range(1, 27):
    #    pn = int(getPageNum(i))
    #    if pn > 0:
    #        for j in range(1, pn+1):
    #            getChengyu(i, j)

    #getChengyu(1, 1)
    #print(getPageNum(1))
    # Step2: 根据成语链接，获取成语具体信息
    #f1=open("chengyu_urls.csv","r",encoding="utf-8")
    #f2=open("chengyu_introText_test.csv","a",encoding="utf-8")
    #urls=f1.read().split("\n")
    #print(len(urls))
    #for url in urls[0:]:
    #    chengyu, pinying, jieshi,chuchu,shili,jinyi,fanyi =getIntroduction(url)
    #    f2.write("%s|%s|%s|%s|%s|%s|%s\n" % (chengyu, pinying, jieshi,chuchu,shili,jinyi,fanyi))

    # Step3: 填充成语结构
    #  f1=open("chengyu_introText_test.csv","r",encoding="utf-8")
    #  f2=open("chengyu_introText_test2.csv","a",encoding="utf-8")
    #  lines=f1.read().split("\n")
    #  print(len(lines))
    #  for line in lines[0:]:
    #      chengyu = line.split("|")[0]
    #      struct = getStruct(chengyu)
    #      f2.write("%s|%s\n" % (line,struct))
     #print(getStruct("安乐窝"))

    # Step4: 填充年级
    #f1 = open("chengyu_introText_test2.csv", "r", encoding="utf-8")
    #f2 = open("chengyu_introText_test3.csv", "a", encoding="utf-8")
    #lines = f1.read().split("\n")
    #g1 = u"1.千门万户2.歪歪扭扭3.高高兴兴4.漂漂亮亮1.兴致勃勃2.莺歌燕舞3.自言自语4.东张西望5.万紫千红6.鸟语花香7.和风细雨8.取人之长补己之短9.夕发朝至10.齐心合力"
    #g2 = u"1.层林尽染叠翠流金2.春华秋实3.绿树成荫（阴）4.川流不息5.不约而同6.尺有所短7.寸有所长8.相得益彰9.管中窥豹10.坐井观天11.一叶障目不见泰山12.拔苗助长13.徒劳无功14.瓜熟蒂落15.水到渠成16.无影无踪17.迫不及待18.一本正经19.六神无主20.七嘴八舌21.八仙过海22.九牛一毛23.十全十美24.吞吞吐吐25.议论纷纷26.叫苦连天27.雪中送炭28.指手画脚29后羿射日30精卫填海31嫦娥奔月32.女娲补天33.引人注目1.遮遮掩掩2.倾盆大雨3.四面八方4.冷冷清清5.隐隐约约6.五光十色7.笑容满面8.金碧辉煌9.焕然一新10.绚丽多彩11.光彩夺目12.从天而降13.五颜六色14.能工巧匠15.冥思苦想16.刨根问底17.浓墨涂抹18.栩栩如生19.风和日丽20.目不转睛21.揠苗助长22.筋疲力尽23.守株待兔24.同心协力25.众志成城26.万众一心27.战无不胜28.天外有天29.博采众长30.多多益善31.贪小失大32.舍本逐末33.轻重倒置34.小题大做35.书读百遍其义自见36.恍然大悟37.万马奔腾"
    #g3 = u"1. 满载而归2闻鸡起舞3翻来覆去4.翩翩起舞5.大惊失色6.垂头丧气7.五彩缤纷8.争奇斗艳9.昙花一现10.千里迢迢11.不紧不慢12.风餐露宿13.风尘仆仆14.奔流不息15.舍近求远16.头重脚轻17.异口同声18.左邻右舍19.里应外合20.成群结队21.琳琅满目22.应有尽有23.物美价廉24.一应俱全25.举世闻名26.五洲四海27.山重水复28.柳暗花明29.合二为一30.大显神威31.庞然大物32.相提并论33.没精打采（无精打采）34.灰心丧气35.千里之行始于足下36.百尺竿头更进一步37.耳听为虚眼见为实38.人无完人金无足赤39.刻舟求剑40.不假思索41.兴高采烈42.沉默不语43.如愿以偿44.彬彬有礼45.恋恋不舍46.日夜兼程47.高楼大厦48.糊里糊涂49.摇头晃脑50.鸦雀无声51.一字不漏52.不知不觉1.翩翩起舞2.活蹦乱跳3.惊叹不已4.群芳吐艳5.落英缤纷6.郁郁葱葱7.喷薄欲出8.旭日东升9.夕阳西下10.皓月当空11.崇山峻岭12.悬崖峭壁13.层峦叠翠14.苍翠欲滴15.生花妙笔16.饥寒交迫17.应有尽有18.沉默不语19.亡羊补牢20.南辕北辙21.惊弓之鸟22.和颜悦色23.连绵起伏24.买椟还珠25.光阴似箭26.日月如梭27.诚心诚意28.脱口而出29.博览群书30.孜孜不倦31.勤学好问32.学而不厌33.业精于勤34.专心致志35.聚精会神36.废寝忘食37.竭尽全力38.脚踏实地39.开门见山40.大材小用41.小题大做42.百发百中43.异口同声44.神气十足45.左顾右盼46.寂然无声47.迫在眉睫48.喜出望外49.如愿以偿50.蹑手蹑脚51.寸草不生52.目不转睛53.恋恋不舍54.无影无踪55.荒无人烟56.身无分文57.趔趔趄趄58.名不虚传59.游人如织60.琳琅满目61.栩栩如生62.爱不释手63.语无伦次64.交口称赞65.下落不明66.闻名遐迩67.历历在目68.面面俱到69.头头是道70.源源不断71.彬彬有礼72.息息相关73.蒸蒸日上74.津津有味75.滔滔不绝76.心灵手巧77.人烟稀少78.提心吊胆79.面如土色80.欢歌笑语81.熊熊大火82.夸父逐日83.四面八方84.人山人海85.惟妙惟肖86.零零星星87.大惊小怪88.画龙点睛89.赞不绝口90.美中不足91.风雨交加92.腾云驾雾93.垂头丧气94.妙不可言95.气焰嚣张96.争分夺秒97.横行霸道98.拍手称快99.同归于尽100.奔走相告101.喜气洋洋102.痛改前非"
    #g4 = u"1.若隐若现2.人声鼎沸3.水天相接4.齐头并进5.浩浩荡荡6.山崩地裂7.风号浪吼8.汹涌澎湃9.咫尺为邻10.11.不容置疑12.千姿百态13.神来之笔14.人迹罕至15.涓涓细流16.应接不暇17.恍恍惚惚18.神秘莫测19.随遇而安20.坐卧不安21.不可思议22.枉费心机23.浩如烟海24.胸有成竹25.家喻户晓26.妇孺皆知27.呲牙咧嘴28.嘟嘟囔囔29.左顾右盼30.大模大样31.一丝不苟32.从容不迫33.扬长而去34.空空如也35.不胜其烦36.慢条斯理37.无忧无虑38.耀武扬威39.偷偷摸摸40.生气勃勃41.跃然纸上42.颤颤巍巍43.如怨如诉44.趁其不备45.变化多端46.局促不安47.望子成龙48.来龙去脉49.群龙无首50.龙飞凤舞51.如虎添翼52.调虎离山53.骑虎难下54.照猫画虎55.天马行空56.汗马功劳57.马到成功58.老马识途59.牛刀小试（小试牛刀）60.笨鸟先飞61.呆若木鸡62.胆小如鼠63.不以为然64.打躬作揖65.目瞪口呆66.崇山峻岭67.神清气爽68.所向披靡69.昂首挺胸70.神态自若71.久经沙场72.整装待发73.跃跃欲试74.颔首低眉75惟妙惟肖76.流连忘返77曲径通幽78.突如其来79.屏息凝神80.号啕大哭81.饶有兴趣82.杏林春满（誉满杏林）83.疑惑不解84.衣衫褴褛85.得意洋洋86.铿锵有力87.莫名其妙88.受益匪浅89.形单影只90.年逾古稀（古稀之年）91.灯红酒绿92.腾云驾雾93.欣喜若狂94.画龙点睛（点睛之笔）95.茹毛饮血96.毋庸置疑97.用武之地98.呼风唤雨99.出乎意料100.无可奈何101.迥然不同102.气势磅礴103.虎背熊腰104.纤尘不染105.比比皆是106.名副其实107.烟熏火燎108战火纷飞109.不露声色110.大名鼎鼎111.（名）不见经传）112.一举成名113.赞叹不已1.波澜壮阔2.拔地而起3.斑斑点点4.重重叠叠5.星罗棋布6.梦寐以求7.闷闷不乐8.走街串巷9.疲惫不堪10.狼吞虎咽11.骨瘦如柴12.将心比心13.言而有信14.己所不欲，勿施于人15.精诚所至，金石为开16.争先恐后17.若无其事18.见死不救19.鱼贯而出20.愚不可及21.气喘吁吁22.响彻云霄23.叫苦不迭24.不折不扣25.横七竖八26.异想天开27.轻而易举28.垂头丧气29.不慌不忙30.聚精会神31.不速之客32.知己知彼，百战百胜33.运筹帷幄，决胜千里34.出其不意，攻其不备35.围魏救赵，声东击西36.四面楚歌37.腹背受敌38.草木皆兵39.所向无敌40兵贵神速41.神出鬼没42.风声鹤唳43.枝繁叶茂44.磕磕绊绊45.凹凸不平46.栩栩如生47.热泪盈眶48.与世长辞49.重见天日50.夺眶而出51.改天换地52.傲然挺立53.神气十足54.前赴后继55.手不释卷56.头头是道57.悠然自得58.默默无言59.万紫千红60.当之无愧61.纵横交错62.此起彼落63.胆大妄为64.全神贯注65.莫名其妙66.拍手叫好67.赏心悦目68.融为一体69.雄心壮志70.坚定不移71.坚忍不拔72.自强不息73.聚沙成塔74.集腋成裘75.持之以恒76.全力以赴77.知难而进78.无坚不摧79.知难而退80.碌碌无为81.一曝十寒82.寸进尺退83.有始无终84.半途而废85.鹏程万里86.纪昌学射87.百发百中88.无能为力89.气急败坏90.笑逐颜开91.无恶不作92.荣华富贵93.恩将仇报94.灵机一动95.寝食不安96.杳无音信97.泪如泉涌98.情不自禁99.举目四望"
    #g5 = u"1. 饥肠辘辘2.依依不舍3.绿林好汉4.滚瓜烂熟5.毫不犹豫6.津津有味7.天长日久8.如醉如痴9.浮想联翩10.囫囵吞枣11.不求甚解12.悲欢离合13.如饥似渴14.不言而喻15.黯然神伤16.千篇一律17.别出心裁18.与众不同19.大显身手20.呕心沥血21.心安理得22念念不忘23.开卷有益24.颇负盛名25.顶天立地26.指指点点27.日出而作，日落而息28.守望相助29.安然无恙30.藕断丝连31.庞然大物32.气象万千33.小心翼翼34.不容置辩35.大喜过望36.源源不断37.络绎不绝38.不动声色39.心灵手巧40.发人深思41.水滴石穿（滴水穿石）42.绳锯木断43.七嘴八舌44.井然有序45.恭恭敬敬46.付之东流47.盖世无双48.抑扬顿挫49.古色古香50.肃然起敬51.无穷无尽52.失魂落魄53.震耳欲聋54.万水千山55.失声痛哭56.一如既往57.喋喋不休58.雪上加霜59.按图索骥60.来日方长61.忐忑不安62.毫无疑义63.聊胜于无64.淡泊明志，宁静致远65.不可估量66.众星拱月67.玲珑剔透68.诗情画意69.奇珍异宝70.满腔怒火71.斩钉截铁72.坚强不屈73.气壮山河74.同仇敌忾75.临危不惧76.勇往直前77.前仆后继78.力挽狂澜79.中流砥柱80.大义凛然81.不屈不挠82.披荆斩棘83.奋发图强84.励精图治85.任重道远86.再接再厉87.排山倒海88.马革裹尸89.夜以继日90.大公无私91.响遏行云92.腾空而起93.生生不息94.名门望族95.瞻前顾后96.充耳不闻97.无动于衷98.正襟危坐99.不苟言笑100.声名远扬101.窃窃私语102.纷纷扬扬1.一碧千里2.不计其数3.美轮美奂4.投笔从戎5.严阵以待6.斗志昂扬7.七零八落8.不翼而飞9.劈头盖脸10.杯水车薪11.始料不及12.废寝忘食13.遥遥在望14.急中生智15.不声不响16.马马虎虎17.绞尽脑汁18.默不作声19.不怀好意20.一动不动21.面不改色22.完好无损23.能言善辩24.喃喃自语25.不动声色26.了如指掌27.安居乐业28.不惜代价29.同归于尽30.喜出望外31.三长两短32.奄奄一息33.势不可当34.势不可挡35.跌跌撞撞36.生死关头37.舍己为人38.辛辛苦苦39.一声不吭40.程门立雪41.理直气壮42.完璧归赵43.负荆请罪44.神机妙算45.三顾茅庐46.踉踉跄跄47.拖男挈女48.喜不自胜49.天造地设50.伸头缩颈51.抓耳挠腮52.拱伏无违53.自有妙用54.平安无事55.故伎重演56.按兵不动57.心急如焚58.不能自拔59.一落千丈60.铤而走险61.良药苦口62.忠言逆耳63.人才辈出64.手疾眼快65.精神抖擞66.仰面朝天67.敛声屏气68.半信半疑69.天衣无缝70.妙不可言71.淋漓尽致72.文质彬彬73.仪表堂堂74.虎背熊腰75.身强力壮76.神采奕奕77.满面春风78.目瞪口呆79.健步如飞80.活蹦乱跳81.大摇大摆82.点头哈腰83.低声细语84.巧舌如簧85.娓娓动听86.语重心长87.入木三分88.莞尔一笑89.花团锦簇90.姹紫嫣红91.应接不暇92.耐人寻味93.手忙脚乱94.水天一色95.熟视无睹96.冲锋陷阵97.以一当十98.彬彬有礼99.翩翩起舞100.摇头晃脑101.色彩斑斓102.繁花似锦103.含情脉脉104.目不暇接105.取之不尽，用之不竭106.融为一体107.多姿多彩108.大饱眼福109.息息相关110.无与伦比111.鹤立鸡群112.叹为观止113.呲牙咧嘴114.讨价还价115.风烛残年116.神态自若117.三言两语118.和颜悦色119.冰天雪地120.不约而同121.笑容可掬122.旁若无人123.别出心裁"
    #g6 = u"1.德高望重2.津津乐道3.熙熙攘攘4.意味深长5.大街小巷6.望而生畏7.不拘一格8.旁逸斜出9.亭亭玉立10.窈窕淑女11.年过花甲12.返璞归真13.别有深意14.行色匆匆15.左冲右撞16.名噪一方（名噪一时）17.悬崖峭壁18.食不下咽19.寝不安席20.思潮起伏21.可见一斑22.魂牵梦萦23.碧空如洗24.波涛起伏25.百折不回26.顶天立地27.蹒跚学步28.大江南北29.长风破浪30.水落石出31.牙牙学语32.汹涌澎湃33.干干净净34.心惊肉跳35.忐忑不安36.流连忘返37.身无分文38.溜之大吉39.刻骨铭心40.十指连心41.怒目圆睁42.不由分说43.蹑手蹑脚44.尽心尽力45.无法割舍46.无所不知47.从未谋面48.自作自受49.大吃一惊50.和蔼可亲51.苟延残喘52.面目全非53.罪魁祸首54.风雨同舟55.三番五次56.一命呜呼57.敌众我寡58.竭泽而渔59.论功行赏60.囫囵吞枣61.张冠李戴62.饱经风霜63.模模糊糊64.三更半夜65.跃然纸上66.谋财害命67.哄堂大笑68.五花八门69.若隐若现70.姗姗来迟71.逸闻趣事72.略胜一筹73.有声有色74.不甘落后75.千方百计76.哭笑不得77.威风凛凛78.优哉游哉（悠哉游哉）79.漫不经心80.久别重逢81.泣不成声82.日落西山83.震耳欲聋84.炯炯有神85.长途跋涉86.横遭不幸87.引人入胜88.享有盛誉89.高山流水90.波涛汹涌91.举足轻重92.回味无穷93.百看不厌94.有朝一日95.转瞬即逝96.不解之缘97.暗无天日98.兴味盎然99.为所欲为100.目不忍视101.雕梁画栋102.巧夺天工103.独具匠心104.余音绕梁105.不落窠臼106.雅俗共赏107.美不胜收108.脍炙人口109.曲高和寡110妙笔生花111.阳春白雪112.笔走龙蛇113.不同凡响114.别具一格115.高不可攀116.盛气凌人117.万古长青118.兴国安邦119.一声不响120.疲倦不堪121.郁郁葱葱122.心旷神怡123.一针见血124.从容镇定125.一声不吭126.无动于衷127.虎视眈眈1.专心致志2.莫名其妙3.无缘无故4.勃勃生机5.座无虚席6.不知所措7.各有所长，各有所短8.养尊处优9.一鼓作气10.邯郸学步11.跋山涉水12.手足无措13.绚丽多姿14.万象更新15.万不得已16.截然不同17.张灯结彩18.热气腾腾19.悠悠扬扬20.开山鼻祖21.两面三刀22.青面獠牙23.安然无恙24.秩序井然25.遮天盖地26.蜂拥而至27.喜气洋洋28.载歌载舞29.郑重其事30.知足安命31.聊以自慰32.臭味相投33.无依无靠34.游手好闲35.荒无人烟36.无拘无束37.落荒而逃38.鱼贯而入39.东窜西走40.惊弓之鸟41.软弱无力42.费尽口舌43.荒唐离奇44.卧床不起45.衣衫褴褛46.滔滔不绝47.闻所未闻48.与世隔绝49.有血有肉50.济济一堂51.匆匆忙忙52.果不其然53.人声鼎沸54.肃然无声55.顺藤摸瓜56.卓有成效57.严于律己58.公正不阿59.鲲鹏展翅60.九天揽月61.夜以继日62.积劳成疾63.风华正茂64.猝然长逝（溘然长逝）65.锲而不舍66.司空见惯67.追根求源68.无独有偶69.打破沙锅问到底70.见微知著71.出人意料72.侃侃而谈73.深信不疑74.想方设法75.饶有趣味76.百炼成钢77.奋发图强78.坚持不懈79.迎难而上80.集思广益81.群策群力82.革故鼎新83.标新立异84.独出心裁85.举一反三86.实事求是87.各抒己见88.不耻下问89.触类旁通90.精益求精91.古为今用92.舍本逐末93.细枝末节94.图文并茂95.桃李满门96.娓娓动听97.身临其境98.戛然而止99.十年树木，百年树人100.前仰后合101.诲人不倦102.热火朝天103.琳琅满目104.历历在目105.流光溢彩106.置之不理107.奇花异草108.秉烛夜游109.三年五载110.惊涛骇浪111.望子成龙112.龙腾虎跃113.生龙活虎114.龙凤呈祥115.举世瞩目116.扭转乾坤117.前俯后仰118.开门见山119.一五一十"
    #for line in lines[0:]:
    #    chengyu = line.split("|")[0]
    #    grade = ""
    #    if g1.find(chengyu) > 0:
    #        grade = u"一年级"
    #    elif g2.find(chengyu) > 0:
    #        grade = u"二年级"
    #    elif g3.find(chengyu) > 0:
    #        grade = u"三年级"
    #    elif g4.find(chengyu) > 0:
    #        grade = u"四年级"
    #    elif g5.find(chengyu) > 0:
    #        grade = u"五年级"
    #    elif g6.find(chengyu) > 0:
    #        grade = u"六年级"
    #    f2.write("%s|%s\n" % (line, grade))

    # Step5: 填充描写，标签
    labeldir="desc"
    labelsmap = {}
    for root, dirs, files in os.walk(labeldir):
        for file in files:
            tag = os.path.splitext(file)[0]
            print(tag)
            tagfile = open(os.path.join(root, file), "r", encoding="utf-8")
            for line in tagfile.readlines():
               if line.strip() == "":
                   continue
               if line.rstrip() not in labelsmap:
                   labelsmap[line.rstrip()] = tag
               elif not labelsmap[line.rstrip()].find(tag) >= 0:
                   labelsmap[line.rstrip()] = labelsmap[line.rstrip()]+","+tag
    print("Tag index finished...")
    f1 = open("chengyu_introText_test3.csv", "r", encoding="utf-8")
    f2 = open("chengyu_introText_test4.csv", "a", encoding="utf-8")
    for line in f1.readlines():
        chengyu = line.rstrip().split("|")[0]
        if chengyu in labelsmap:
            f2.write("%s|%s\n" % (line.rstrip(), labelsmap[chengyu]))
        else:
            f2.write("%s|%s\n" % (line.rstrip(), ""))











